Repository: 84000/data-translation-memory
Catalog: toh381_84000-emergence-from-samputa.tmx
Source language: bo
Languages: en

source: །ཤར་དུ་ནི་རྣམ་པར་སྣང་མཛད་དོ།
en: “In the east there is Vairocana;

source: །ལྷོར་ནི་རིན་ཆེན་འབྱུང་གནས་སོ།
en: In the south, Ratnasambhava;

source: །ནུབ་ཏུ་ནི་འོད་དཔག་ཏུ་མེད་པའོ།
en: In the west, Amitābha;

source: །བྱང་དུ་ནི་གདོན་མི་ཟ་བར་གྲུབ་པའོ།
en: And in the north, Amoghasiddhi.

source: །དབང་ལྡན་དུ་ནི་སྤྱན་ནོ།
en: “In the northeast there is Locanā;

source: །མེར་ནི་མཱ་མ་ཀཱིའོ།
en: In the southeast, Māmakī;

source: །བདེན་བྲལ་དུ་ནི་གོས་དཀར་མོའོ།
en: In the southwest, Pāṇḍaravāsinī;

source: །རླུང་དུ་ནི་སྒྲོལ་མའོ།
en: And in the northwest, Tārā.

source: །ཕྱི་རོལ་གྱི་འཕར་མ་ལ་དྲག་ཤུལ་མ་ནི་ཁ་དོག་དཀར་མོའོ།
en: “In the outer circle, “White Raudrī in the east,

source: །ལྷོ་རུ་ནི་རྡོ་རྗེ་གཟུགས་བརྙན་མ་ནི་ཁ་དོག་སེར་མོའོ།
en: Yellow Vajrabimbā in the south,

source: །ནུབ་ཏུ་ནི་འདོད་ཆགས་རྡོ་རྗེ་མ་ཁ་དོག་དམར་མོའོ།
en: Red Rāgavajrā in the west,

source: །བྱང་དུ་ནི་རྡོ་རྗེ་ཞི་བ་མོ་ཁ་དོག་ལྗང་གུ་མའོ།
en: And green Vajrasaumyā in the north.

source: །དབང་ལྡན་དུ་ནི་རྡོ་རྗེ་གནོད་སྦྱིན་མོ་ཁ་དོག་དཀར་སེར་ལྟ་བུའོ།
en: “In the northeast there is white and yellow Vajrayakṣī;

source: །མེ་རུ་ནི་རྡོ་རྗེ་མཁའ་འགྲོ་མ་དམར་སེར་ལྟ་བུའོ།
en: In the southeast, yellow and red Vajraḍākinī;

source: །བདེན་བྲལ་དུ་ནི་སྒྲའི་རྡོ་རྗེ་མ་ནི་སྔོན་དམར་ལྟ་བུའོ།
en: In the southwest, red and blue Śabdavajrā;

source: །རླུང་དང་སའི་རྡོ་རྗེ་མ་ནི་ཁ་དོག་ལྗང་སྐྱ་མ་ལྟ་བུའོ།
en: And in the northwest, green and white Pṛthivīvajrā.

source: །ཕྱི་རོལ་གྱི་འཕར་མ་ལ་དབང་ལྡན་དུ་ནི་གླིང་བུ་མའོ།
en: “In the outer circle,

source: །མེ་རུ་ནི་བི་པྃ་མའོ།
en: “In the northeast, Vaṃśā;In the southeast, Vīṇā;

source: །བདེན་བྲལ་དུ་ནི་མུ་ཀུན་ད་མའོ།
en: In the southwest, Mukundā;

source: །རླུང་དུ་ནི་རྫ་རྔ་མའོ།
en: And in the northwest, Murajā.

source: །གླིང་བུ་མ་ལ་སོགས་པ་ནི་ཕྱག་གཉིས་མ་ལ་ཞལ་གཅིག་མའོ།
en: “Vaṃśā and the other three have two arms and a single face.

source: །ཕྱི་རོལ་གྱི་སྣམ་བུ་ལ་མེ་ཏོག་མ་ལ་སོགས་པའི་མཚན་མ་འཛིན་པའི་རྣལ་འབྱོར་མ་དེ་གཞག་པར་བྱ་སྟེ།
en: “On the outer rim there should be placed the yoginīs of the maṇḍala, each holding her respective emblem—the flower, and so forth.

source: དེ་བཞིན་དུ་ཕྱག་གཉིས་མའོ།
en: They likewise have two arms.

source: །ཤར་གྱི་སྒོ་ལ་ལྷ་མོ་རྡོ་རྗེ་ལྕགས་ཀྱུ་མ་ནམ་མཁའ་སྔོ་བསངས་མའི་མདོག་བྲི་བར་བྱ་སྟེ། ཞལ་གཡས་པ་དང་། གཞན་པ་ནི་གནག་པ་དང་དཀར་པོའོ།
en: “At the eastern gate one should draw the goddess Vajrāṃkuśī, the color of dark sky, with her right and left faces black and white respectively.

source: །ཕྱག་གཡས་པའི་དང་པོ་ནི་ལྕགས་ཀྱུའོ། །གཉིས་པ་ལ་ནི་རལ་གྲི་འཕྱར་བའོ། །གསུམ་པ་ལ་ནི་འཁོར་ལོའོ།
en: In her first hand she holds a goad, in the second she brandishes a sword, and in the third she holds a discus.

source: །གཡོན་པ་ན་ནི་ཞགས་པ་དང་། སྡིགས་མཛུབ་དང་། དྲིལ་བུ་འཛིན་པ་སྟེ་ཕྱག་དྲུག་པ་བྲི་བར་བྱའོ།
en: Her left hands hold a noose, display a threatening gesture, and hold a bell. These are the emblems in her six hands.

source: །ལྷོའི་སྒོར་ལྷ་མོ་རྡོ་རྗེ་ཞགས་པ་མ་ཁ་དོག་དཀར་སེར་ཏེ། ཞལ་གཡས་པ་དང་། གཞན་པ་ནི་གནག་པ་དང་དམར་བའོ།
en: “At the southern gate one should draw the white and yellow mother, Vajrapāśī, whose right and left faces are black and red respectively.

source: །གཡས་པ་ན་ནི་ཞགས་པ་དང་། རྡོ་རྗེ་དང་། རལ་གྲི་འཕྱར་བའོ། །འཁོར་ལོ་དང་། དྲིལ་བུ་དང་། སྡིགས་མཛུབ་ཞགས་པ་ཅན་ཏེ་ཕྱག་དྲུག་གོ།
en: In her right hands she brandishes a noose, a vajra scepter, and a sword. In her left hands she holds a discus and a bell, and holds a noose while forming a threatening gesture. These are the emblems in her six hands.

source: །ནུབ་ཀྱི་སྒོ་ལ་ནི་རྡོ་རྗེ་ལྕགས་སྒྲོག་མ་སྟེ། དེ་བཞིན་དུ་ཡང་ཁ་དོག་དམར་ཞིང་གཟི་བརྗིད་ཆེ་བ་སྟེ།
en: “At the western gate one should draw Vajrasphoṭā, red in color and with great brilliance.

source: ཞལ་གཡས་པ་དང་གཞན་པ་ནི་གནག་པ་དང་དཀར་བའོ།
en: Her right and left faces are black and white respectively.

source: །ཕྱག་དྲུག་ན་ལྕགས་སྒྲོག་དང་། རྡོ་རྗེ་དང་། རལ་གྲི་དང་། འཁོར་ལོ་དང་། དྲིལ་བུ་དང་། ལྕགས་ཀྱུའོ།
en: In her six hands she is holding, on the right, a fettering chain, a vajra scepter, and a sword, and on the left, a discus, a bell, and a goad. These are the emblems in her six hands.

source: །བྱང་གི་སྒོ་ལ་ནི་རྡོ་རྗེ་དྲིལ་བུ་མ་འཇིགས་པར་བྱེད་མ་སྟེ།
en: “At the northern gate there is the terrifying Vajraghaṇṭā.

source: ཞལ་གསུམ་ནི་ལྗང་གུ་དང་། ནག་མོ་དང་། དཀར་མོའོ།
en: She has three faces: the middle one is green, the right one black, and the left one white.

source: །ཕྱག་དྲུག་ན་ནི་དྲིལ་བུ་དང་། རྡོ་རྗེ་དང་། ལྕགས་ཀྱུ་དང་། འཁོར་ལོ་དང་། རལ་གྲི་དང་། ཞགས་པའོ།
en: In her six hands she holds a bell, a vajra scepter, a sword, a discus, a goad, and a noose.

source: །ཐམས་ཅད་ཀྱང་སྐྲ་སྟེང་དུ་འབར་བ་སྟེ། སྣ་ཚོགས་པདྨར་ཉི་མའི་དཀྱིལ་འཁོར་དུ་གཞག་པར་བྱའོ།
en: “All should be visualized standing on a sun disk upon a multicolored lotus, with their blazing hair flowing upward.

source: །མེའི་ཕྱོགས་ནས་བརྩམས་ཏེ་མེ་ཏོག་ལ་སོགས་པའི་མཚན་མ་འཛིན་པའི་རྣལ་འབྱོར་མ་དེ་གཞག་པར་བྱ་སྟེ་ཕྱག་གཉིས་མར་གསུངས་སོ།
en: “In the intermediate directions, starting from the southeast, there are yoginīs who hold their respective emblems—the flower, and so forth. They are typically known to possess two arms.

source: །ཤར་ལ་སོགས་པའི་སྒོ་རྣམས་སུ་ནི་རྣལ་འབྱོར་མ་ལྕགས་ཀྱུ་མ་དང་། ཞགས་པ་མ་དང་། ལྕགས་སྒྲོག་མ་དང་། དྲིལ་བུའི་ལག་པ་མ་སྟེ།
en: “At the gates starting from the east, there are yoginīs holding a goad, a noose, a fettering chain, and a bell.

source: སྒོ་སྲུངས་མ་དང་ཡང་དག་པར་ལྡན་པའོ།
en: Thus the maṇḍala is provided with gatekeepers.

source: །ཛཿཧཱུྃ་བྃ་ཧོཿཞེས་བྱ་བ་འདི་རྣམས་ཀྱི་སྙིང་པོ་བསྟན་པ་སྟེ་ཐེ་ཚོམ་མི་ཟའོ།
en: “The syllables jaḥ , hūṁ , vaṁ , and hoḥ are taught to be their respective heart mantras;

source: །དེ་ལྟར་བཀོད་པ་དང་བྱས་པ་ལ་སོགས་པའི་ཚུལ་གྱིས་ཀྱང་མཚན་མ་དང་ཕྱག་རྒྱ་དང་ལྡན་པའི་དཔལ་རྡོ་རྗེ་སེམས་དཔའི་ཕྱིའི་དཀྱིལ་འཁོར་རོ།
en: there is no doubt about this. Through being arranged, fashioned, and so forth in this manner, this is the outer maṇḍala of glorious Vajrasattva, replete with the emblems and gestures.

source: །གོང་མ་ལྟ་བུ་དེའི་ཕྱེད་ཀྱིས་དེའི་ནང་དུ་ཟླ་བ་ཕྱེད་པའི་དབྱིབས་ལྟ་བུའི་རླུང་གི་དཀྱིལ་འཁོར་དང་ཀ་བ་བརྒྱད་ཀྱིས་ཉེ་བར་མཛེས་པ་དང་། །ཕྱི་རོལ་དུ་རི་མོ་བཞིས་ཡོངས་སུ་བསྐོར་བའོ།
en: “Inside the outer maṇḍala, the same design as before, is another, half its size—the maṇḍala of the wind element, in the shape of a half-moon disk, adorned with eight pillars, and surrounded on the outside with a quadruple line.

source: །ལྷ་མོ་ཐམས་ཅད་ཀྱི་གནས་སུ་ཇི་སྐད་གསུངས་པའི་གདན་རྣམས་ནི་དཀར་མོ་ལ་སོགས་པ་རབ་ཏུ་བརྟག་པར་བྱའོ།
en: “In all the locations assigned to the respective deities, one should arrange Gaurī and the others, along with their thrones, as described.

source: །དེ་ལ་དབུས་སུ་ཧྲཱིཿའི་ཡི་གེ་རྣམ་པར་བསྒོམ་པར་བྱའོ། །དེའི་ཤར་གྱི་རེའུ་མིག་ལ་ནི་ཧྲཱིཿའོ། །ལྷོ་རུ་ནི་ཧོའོ། །ནུབ་ཏུ་ནི་གཱིའོ།
en: In the center one should visualize the syllable hrīḥ ; in the quarter toward the east, the syllable hrīḥ ; in the south, the syllable hiḥ ; in the west, the syllable gīḥ ; in the north, the syllable jiḥ ; in the southeast, the syllable taṁ

source: །བྱང་དུ་ནི་ཛིའོ། །མེ་རུ་ནི་ཧྃ་ངོ་།
en: in the southwest, the syllable jaṁ

source: །བདེན་བྲལ་དུ་ནི་ཛྃ་ངོ་། །རླུང་དུ་མྃ་ངོ་།
en: in the northwest, the syllable maṁ

source: །དབང་ལྡན་དུ་ཧྃ་ངོ་།
en: and in the northeast, one should place the syllable haṁ

source: །དཀྱིལ་འཁོར་གྱི་ཕྱི་རོལ་དུ་དགོད་པ་ནི་མེའི་མཚམས་སུ་ནི་ཨྃ་ངོ་།
en: “In the outer circle, in the southeast, one should place the syllable oṁ

source: །བདེན་བྲལ་དུ་ནི་ཨུའོ། །རླུང་དུ་ནི་ཨེའོ། །དབང་ལྡན་དུ་ནི་ཨཻ་དགོད་པར་བྱའོ།
en: in the southwest, the syllable aṁ ; in the northwest, the syllable eṁ ; and in the northeast, one should place the syllable aiṁ

source: །ཤར་གྱི་སྒོ་ལ་ཛཿའོ།
en: “At the eastern gate one should place the syllable jaḥ

source: །ལྷོ་རུ་ནི་ཧཱུྃ་ངོ་།
en: at the southern gate, the syllable hūṁ

source: །ནུབ་ཏུ་ནི་པྃ་མོ།
en: at the western gate, the syllable vaṁ

source: །བྱང་དུ་ནི་ཧོཿད་གོད་པར་བྱའོ།
en: and at the northern gate, the syllable hoḥ

source: །ཕྱི་རོལ་དུ་དུར་ཁྲོད་བརྒྱད་ཀྱིས་ཡོངས་སུ་བསྐོར་བའི་དཀྱིལ་འཁོར་བསམས་ཏེ།
en: “Further outside one should visualize, surrounding the maṇḍala, the eight charnel grounds.

source: དེར་དབང་པོ་ལ་སོགས་པའི་འབྱུང་པོ་ཆེན་པོ་བརྒྱད་པོ་འཇིགས་པར་བྱེད་པར་དགོད་པར་བྱའོ།
en: One should place there the eight great spirits, Indra, and the others, who are very frightened.

source: །ཤར་དུ་ཧ་རི་བཱ་ས་ལ།
en: “In the east one should draw

source: །ལྷ་ཡི་ཚོགས་ནི་ཡང་དག་བྲི།
en: A host of gods sitting upon a bodhi tree.

source: །ལྷོ་རུ་ཙུ་ཏའི་ཤིང་ལ་ནི།
en: In the south one should draw

source: །གཤིན་རྗེའི་གཙོ་བོའི་དབང་ཕྱུག་བྲི།
en: The powerful lord Yama atop a mango tree.

source: །ནུབ་ཏུ་ཨ་ཤོ་ཀ་གནས་སུ།
en: “In the west one should place

source: །སྤྲིན་གྱི་རྒྱལ་པོ་དེར་ནི་དགོད།
en: The king of clouds on an aśoka tree.

source: །དེ་བཞིན་བྱང་དུ་བྱང་ཆུབ་ཤིང་།
en: Likewise, in the north one should situate

source: །གནོད་སྦྱིན་སྡེ་དཔོན་མཉམ་པར་གཞག །དེ་བཞིན་མེར་ནི་ཀ་རཉྫར།
en: The army of yakṣas on a bodhi tree. “Similarly, in the southeast one should draw

source: །དྲང་སྲོང་ཚོགས་ཀྱིས་ཡའི་དག་ཁྱབ།
en: A crowd of ṛṣis upon a pongamia tree.

source: །བདེན་བྲལ་ལ་ཏཱ་ཛཱ་ཊིར་ནི།
en: In the southwest, on a jasmine shrub,

source: །སྲིན་པོ་ལ་སོགས་དེ་ནས་དགོད།
en: One should place rākṣasas and the like.

source: །རླུང་དུ་པཱརྠི་པ་ལ་ནི།
en: “In the northwest one should draw

source: །རླུང་གི་བདག་པོ་ཡང་དག་བྲི། །དབང་ལྡན་པ་ཊ་སྠ་ལར་ནི།
en: The lord of wind on a crepe jasmine bush.

source: །ཡི་དགས་ཚོགས་ནི་ཡང་དག་བྲི།
en: In the northeast one should draw

source: །དྲག་བཅས་དབང་བཅས་ཉེ་དབང་བཅས།
en: A crowd of pretas on a banyan tree. “One should live covered in ashes

source: །ཟླ་བཅས་ཉི་མ་གཤིན་རྗེའི་ཆ།
en: Along with Rudra, Indra, Upendra, Candra

source: །རྒྱས་བཏབ་རྨོངས་བྱས་ཟོས་བྱས་ཤིང་།
en: Arka, and Yama, who were sealed

source: །ཐལ་བའི་དངོས་བཅས་འཚོ་བར་བྱེད།
en: And confounded, and their treasures enjoyed.

source: །ཐབས་དང་ཤེས་རབ་རྣལ་འབྱོར་གྱིས།
en: “Further, diligently practicing skillful means and wisdom,

source: །གཡོན་པར་ཁ་ཊྭཱཾ་བརྟེན་ནས་སུ།
en: One should carry, on one’s left side,

source: །དྲིལ་བུ་སིལ་སིལ་སྒྲ་སྒྲོགས་ཤིང་། །ཁྲག་གིས་བཀང་བའི་ཐོད་པ་བསྣམས།
en: A khaṭvāṅga and a skull cup filled with blood, While gently sounding a bell.

source: །གཡས་སུ་རྡོ་རྗེ་འབར་བ་སྟེ།
en: “In one’s right hand one should carry

source: །འཇིགས་པ་ཡང་ནི་འཇིགས་པར་མཛད། །སྐྱིལ་ཀྲུང་ཕྱེད་པ་བྱས་ནས་ནི།
en: A blazing vajra scepter, which frightens even fear itself. Having assumed the ardhaparyaṅka posture,

source: །ཉིད་ཀྱི་བརླ་སྟེང་གཡོན་པ་མནན།
en: One should press down on one’s left thigh.

source: །ཚངས་པ་ལ་སོགས་མནན་པ་དེ།
en: “Stepping over Brahmā, and so forth,

source: །གྲགས་པ་ཉེ་བར་མི་ཟ་སྟེ།
en: One should enjoy this act in a manly manner. He will give . . . “If the practitioner meditates

source: །ཀུན་དུ་འོད་ཟེར་སྣ་ཚོགས་ཀྱིས།
en: Visualizing multicolored light all around

source: །སངས་རྒྱས་སྤྲིན་དང་མཉམ་པ་འདིས། །སྤྲོ་བ་ཡང་ནི་སྦྱིན་པར་བྱ། །དེ་ལྟར་རྣལ་འབྱོར་པས་བསྒོམས་ན།
en: That takes the form of scintillating clouds of buddhas,

source: །དངོས་གྲུབ་མྱུར་དུ་ཐོབ་པར་འགྱུར།
en: He will swiftly gain accomplishment.”

source: །དཔལ་ཡང་དག་པར་སྦྱོར་བ་ལས་བྱུང་བ་སྟེ་བརྟག་པའི་རྒྱལ་པོ་གསུམ་པའོ།།
en: This concludes the sovereign third chapter of the glorious “Emergence from Sampuṭa.” Chapter 4

source: །།བཅོམ་ལྡན་རྣལ་འབྱོར་རྣལ་འབྱོར་མའི།
en: “I would like to hear, O Blessed One,

source: །ངག་གི་ཕྱག་རྒྱའི་མཚན་ཉིད་ཅི། །གསང་བ་ཉན་པར་འཚལ་ལགས་ན།
en: About the characteristics of the external signs.

source: །ཐུབ་པ་ཆེན་པོས་བཤད་དུ་གསོལ།
en: Please tell me, O great sage, This secret of yogins and yoginīs.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་མཁའ་འགྲོ་མ་རྣམ་པར་རྒྱལ་བའི་སྟོབས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནས་མཁའ་འགྲོ་མའི་དམ་ཚིག་གི་ཕྱག་རྒྱ་བཀའ་སྩལ་པ། ཀོལླ་ཨི་རིཊྛི་ཨ་བོལླ། མུམྨུ་ཎི་རེ་ཀཀྐོ་ལཱ། གྷ་ཎ་ཀི་པཱིནྣ་ཧོ་བཱཛྫཾ་ཨི། ཀཱ་རུ་ཎེ་ཀི་ཨ་ཨི་ན་རོ་ལཱ། ཏ་ཧོཾ་བ་ལཱ་ཁཱཛྫ་ཨི། གྷ་ཌེ་མ་ཨ་ཎཱ་པིཛྫ་ཨི།
en: The lord then entered the meditative absorption called “the power of ḍākinīs’ conquest” and explained the pledge signs of ḍākinīs.

source: ཧ་ལེ་ཀཱ་ལིཉྫ་ར་པ་ཎི་ཨ་ཨི།
en: “The vajra is in Kollagiri

source: དུ་དྷུ་ར་བཛྫ་ཨ་ཨི། ཙ་ཨུ་ས་མ་ཀཱསྠུ་ར་སི་ཧླཱ། ཀཔྤུ་རུ་ལཱ་ཨི་ཨ་ཨི། མ་ལ་ཨིནྡྷ་ཎྃ་ཤ་ལི་ཛ།
en: And the lotus is in Muṃmuni.

source: ཏ་ཧིཾ་བྷ་རུ་ཁ་ཨི་ཨ་ཨི། ཕྲེཾ་ཁ་ཎ་ཁེཊྚ་ཀ་རནྟེ།
en: The rattle of the wood is unbroken;

source: ཤུདྡྷ་ཨ་ཤུདྡྷ་ན་མུ་ཎི་ཨ་ཨི།
en: It sounds for compassion, not for quarrels.

source: ཎི་རྃ་ཤུ་ཨང་ག་ཅེ་ཌཱ་བི་ཨ། ཏ་ཧིཾ་ཛ་ས་རཱ་བ་པ་ཎི་ཨ་ཨི།
en: “Here we eat strength And drink passion extravagantly.

source: མ་ལ་ཨ་ཛྃ་ཀུན་དུ་རུ་བཱཊྚ་ཨི། ཌིཾ་ཌི་མ་ཏ་ཧིཎྞ་བཛྫ་ཨ་ཨི། མུ་ཁེ་གྷོ་གྷུ་གུ་གྷུ། མུ་གྷུ་ལུ་གྷུ། དྲེཥྚཱ། འདི་རྣམས་བལྟས་ནས་རྣལ་འབྱོར་པས་མཚན་མ་གསུངས་པ་ཞེས་བྱ་བ་ལ་སྤྲོ་བར་བྱའོ། །ཌཱ།
en: Hey, the Kāliñjaras may enter here;

source: ཌཱི།
en: The emissions are excluded.

source: བུ། སུ།
en: “We ingest the four ingredients

source: མཱ།
en: Also musk , olibanum , and camphor .

source: ཡོ།
en: Here we eat jasmine wood and rice products

source: བྷི།
en: To our satisfaction.

source: དྷཱི།
en: “We do swinging and phlegm

source: ལུ། སྟྲཱི།
en: Without thinking in terms of ‘pure’ and ‘impure.’

source: ས། པེ། ཕཱི། བྷ། བྷུ། པཱི། བྷུ། ཧཱི།
en: Our bodies are naked

source: ག །ཏྲི། ཀུ། ཧཱ།
en: Here we enter the corpse

source: ཛཱ།
en: “At the sandalwood we perform the olibanum ;

source: ཀེ། བྷ། སྭཱ། པུ། ཛཱ། ཨོ། ཨ།
en: Here small drums are not shunned.

source: གོ། རཱ།
en: Mukhe, ghoghu, gughu, mughu, lughu, duṣṭu —one should enthusiastically utter these code words when the signs of a yoginī are seen.

source: དེ། མཱ། ཀཱ། ཨོ། ཏྲི། ཀོ། ཀ།
en: “And also:

source: ལ། ཀཱ།
en: Ḍā, ḍī, pu, su, mā, yo, bhī, vī, lu, strī, sa (?), pe, phī (?), bha, bhū, pī, dū, ḍī, ma, strī, kū, hā, ja, ke, bha, sva, pra, jā, o, mā, go, rā, de, mā, kā , tri, ko, ka, la, kā, hi, mre (?), śri, sau, su, na, si, ma, ku

source: ཧི། པྲེ། གྲྀ། སཽ། སུ། ནཱ། ཤི། མ། ཀུ། དེ་ནས་ངག་གིཙྪོ་མ་ཡི།
en: “Now I shall explain the outer secret signs

source: །ཆོ་གའི་རིམ་པ་བཤད་པར་བྱེ།
en: In the prescribed order,

source: །གང་གིས་སྤུན་དང་སྲིང་མོར་ཡང་།
en: Through which a brother or sister

source: །ཐེ་ཚོམ་མེད་པར་ཤེས་བྱ་བ།
en: Can be recognized without doubt.

source: །པོ་ཏྃ་གཱི་དང་། པྲ་ཏི་པོ་ཏྃ་གཱི་དང་། ག་མུ་དང་། ལུམྦ་དང་། ནི་ག་ར་དང་། ཙ་ཊུ་ཀྃ་དང་། ཧྲྀ་ད་ཡྃ་དང་། ཀཽ་ར་བ་དང་། ཀརྞྞི་ཀཱ་དང་། ཨ་ལི་ཀ་ར་ཎྃ་དང་། བ་རཱ་ཧ་དང་། ཤྲ་ཝ་ཎ་དང་། མནྫ་ན་དང་། ན་རཿདང་། ཏཱ་ལི་ཀཱ་དང་། ན་ར་ཀྃ་དང་། ཨ་མྲུ་ཀྃ་དང་། ཀཱ་ཁི་ལ་དང་། སྭ་ས་ཎྃ་དང་། པ་རི་དྷིཿདང་། བི་ར་དྷིཿདང་། ཀྲུ་རཱ་དང་། ཨནྟཿདང་། ཨ་ལི་ཀཱ་དང་། བྷ་གི་ནཱི་དང་། མུ་ད་ཀྃ་དང་། གྲྀ་ཧ་ཎ་དང་། མུ་དྲཱ་དང་། དནྟ་སྤཪྴ་ཛི་ཧྭཱ་དང་། གནྡྷ་བ་ཧི་ནཱི་དྃང་།
en: “The potaṅgī gesture is answered with the same.

source: ཨཱ་ག་མ་ནྃ་དང་། སྠཱ་ནཱ་ཏ་དང་། ཀི་ར་ཎཿདང་། གོ་མ་དང་། ནཱ་དཱ་དང་། ལམྦོ་ད་ར་དང་། དནྟཿདང་། ནི་རོ་དྷ་དང་། བི་ཛྙ་པྟི་དང་། དྷུ་རྱ་དང་། དྷུ་མྲ་པྲི་ཡ་དང་། སཱ་ནུ་དང་། ས་རི་ཏཿདང་། ཨྃ་གུ་ལྱཱ་དང་། བ་ད་ནྃ་དང་། རཱ་ཛི་ཀཱ་དང་། ཨ་ད་ནཱ་དང་། པྃ་ཀྟི་དང་། ཙྪྣན་དོ་དང་། ཙ་ལོཿདང་། མྲྀ་ག་པ་ཏི་དང་། མཎྜ་ལྃ་དང་། ས་མྃ་དང་། ཕལ་གུ་ཥཾ་དང་། མ་ཧཱ་ཀྵ་རྃ་དང་། ཙྪཱ། ནཱ། གོ་དང་། མ་དང་། བྷ་དང་། ཧཱ་དང་། ཨ་པྱ་ཀཱ་དང་། སྠ་དང་། དནྟ་སྤཪྴ་ནེ་དང་། མུ་ཁ་སྤཪྴ་ནེ་དང་། ཧོ་དང་། ཧྲཱི་ཀཱ་དང་། ཤཱུ་ནྱ་སྤཪྴ་ནེ་དང་། ཨུ་རུ་སྤཪྴ་ནེ་དང་། སྟེང་དང་། འོག་ཏུ་ཡོད་པ་ནི་ཕྱག་རྒྱ་དང་ཕྱག་རྒྱའི་ལན་དུ་གསུངས་སོ།
en: Other code words and signs used are gamu , lumba , ‘swallowing,’ ‘wooden vessel,’ ‘heart,’ ‘Kuru woman,’ ‘earring,’ alikaraṇa , ‘boar,’ ‘hearing,’ ‘churning,’ ‘man,’ ‘palm of the hand,’ ‘hell,’ ‘someone,’ kākhilā , ‘sighing,’ ‘enclosure,’ ‘cessation,’ ‘cruel one,’ ‘end,’ ‘scorpion,’ ‘younger sister,’ mudaka , ‘the grasping one’ which means ‘mudrā,’ ‘touching the teeth,’ ‘perfume seller,’ ‘arrival’ which means ‘from what place,’ ‘ray of light,’ ‘hanging down,’ ‘teeth,’ ‘cessation,’ ‘report,’ ‘smoke,’ ‘fond of smoke,’ ‘summit,’ ‘rivulets,’ ‘finger,’ ‘mouth,’ ‘stripe(?),’ ‘eating,’ ‘series,’ ‘intention,’ ‘movement,’ ‘lord of animals,’ ‘circle,’ ‘the same,’ phālguṣa , ‘great syllable,’ chā , nā , go , ma , bhā , hā , ‘makers of offerings(?),’ and ‘remaining.’ A particular message is conveyed when one is touching one’s mouth or one’s teeth. ‘Bashful.’ A particular message is conveyed when one is touching space, or touching one’s thighs below. The signs and their responses are thus laid down.”

source: །ཡི་གེ་དང་ངག་གི་ཙྪོ་མ་སྟེ་བཞི་པ་ལས་རབ་ཏུ་བྱེད་པ་དང་པོའོ།།
en: This concludes the first part of the fourth chapter on the secret language of letters and speech.

source: །།རྡོ་རྗེ་སྙིང་པོ་སྙིང་རྗེ་ཆེ།
en: “Listen, O most compassionate Vajragarbha,

source: །ཡིད་ནི་གཅིག་ཏུ་གྱུར་པས་ཉོན།
en: With undivided attention. {4.2.1} “Dākinīs are known to be of seven types:

source: །གཟུགས་ཅན་མ་དང་འོ་བྱེད་མ།
en: Rūpikā, Cumbikā, Lāmā,

source: །ལཱ་མཱ་ཡོངས་གྱུར་བྱིས་བཅས་མོ།
en: Parāvṛttā, Samālikā,

source: །མི་ལྡོག་མོ་དང་འདོད་པ་མོ། །འདི་དག་མཁའ་འགྲོ་བདུན་དུ་གསུངས།
en: Anivṛttikā, and Aihikī.

source: །མངོན་པར་ཞེན་པས་ལྟ་བ་དང་། །སྨིན་མ་ཡོན་པོར་གང་བྱེད་ཅིང་།
en: “She who gazes with passion And then frowns,

source: །སྔོན་གྱི་གཟུགས་ནི་སྡུད་པ་དང་། །ཕྱིས་ནི་འཇིགས་པར་བྱེད་པ་ཡང་།
en: Whose beauty seduces at first But later brings ruin,

source: །དེ་ནི་གཟུགས་ཅན་མར་ཤེས་བྱ།
en: Is known as Rūpikā, the beautiful;

source: །དཔའ་བོས་གཉིས་མེད་བསྟན་པའོ།
en: She is served in nonduality by the valiant. {4.2.3} “She who kisses a child as soon as she sees it,

source: །སྡུག་པའམ་གལ་ཏེ་མི་སྡུག་པའི། །བྱིས་པ་ལྟ་ཞིང་འོ་བྱེད་མ།
en: Regardless of whether the child is lovable or not,

source: །དེ་ནི་འོ་བྱེད་མར་ཤེས་བྱ།
en: Is known as Cumbikā, the kisser.

source: །མཁའ་འགྲོ་མཆོག་ཀྱང་དེ་ཉིད་ཡིན།
en: This ḍākinī is very congenial.

source: །བྱོལ་སོང་ལྟ་སྟངས་ཁྲོ་གཉེར་གདོང་།
en: “She who has an animal gaze and an angry expression,

source: །འདི་ནི་སྨིན་སྒྱུར་སྡིགས་པར་བྱེད།
en: Who threatens with her knitted eyebrows,

source: །གཞན་དུ་དབུགས་ཀྱིས་འཇིགས་བྱེད་མ།
en: And frightens others with her heavy sighs,

source: །དེ་ནི་ལཱ་མཱར་རྣམ་པར་བསྟན།
en: Is to be known as Lāmā. {4.2.5} “She who frightens away

source: །ཕག་དང་ཅེ་སྤྱང་བྱི་ལ་དང་། །རྟ་རྣམས་ཐམས་ཅད་འཇིགས་བྱེད་མ།
en: All wild boars, jackals, cats, and horses

source: །དེ་ནི་ཡོངས་གྱུར་མ་རུ་གསུངས།
en: Is called Parāvṛttā, the one who repels.

source: །རབ་ཏུ་དགའ་ཞིང་གསལ་བར་དགོད།
en: “She who is happy and laughs gregariously,

source: །སོང་བར་གྱུར་ནས་མི་ལྡོག་མ།
en: And who, once gone, never returns

source: །དེ་ནི་བྱིས་བཅས་མོ་རུ་གསུངས།
en: Is known as Samālikā. {4.2.7} “She by whose touch, when she is upset, one will die—

source: །གང་ཞིག་སྐྱོ་བས་ལག་པ་འམ།
en: Whether it be by her hand, a clod of earth where she walked,

source: །བོང་པ་འམ་ནི་རྐང་པས་སམ། །གོས་མཐའ་མ་ཡང་ན་ཤིང་གིས་ནི། །དེས་རེག་པ་ནི་འཚོ་མི་འགྱུར།
en: Her foot, the end of her garment, or a stick that she touched—

source: །དེ་ནི་མི་ལྡོག་མར་ཤེས་བྱ།
en: Is called Anivṛttikā.

source: །རྒོད་དང་སྨྲ་དང་ངུ་བ་དང་། །གློ་བུར་དུ་ནི་ཁྲོ་འགྱུར་བ།
en: “She who laughs, talks, cries, Or suddenly gets angry

source: །དེ་ནི་འདོད་པ་མར་ཤེས་བྱ།
en: Is known as Aihikā,

source: །མཁའ་འགྲོ་རྣལ་འབྱོར་མར་གསུངས་སོ།
en: The ḍākinī, mother of yogins.

source: །ཐོད་པ་དགྲ་སྟ་མཆེ་བ་དང་། །ཆུ་སྲིན་རྒྱལ་མཚན་རལ་གྲི་དང་། །འཕང་མདུང་དང་ནི་བདུན་དུ་གསུངས། །ཡང་དག་སྦྱོར་བའི་ཆོ་ག་འདི།
en: “They each hold a skull cup, an axe, an elephant tusk, a banner made from crocodile skin, a sword, a lance, and a conch, which are known to be their seven respective implements.

source: །རྣལ་འབྱོར་རིག་པས་རྟག་ཏུ་མཆོད།
en: “The adept of yoga should always be able to recognize these signs according to the procedure of sampuṭa.”

source: །ལུས་སྲུལ་མོའི་མཚན་མ་དང་ཕྱག་རྒྱ་སྟེ་བཞི་པ་ལས་རབ་ཏུ་བྱེད་པ་གཉིས་པའོ།།
en: This concludes the second part of the fourth chapter on the characteristics and signs particular to demon ḍākinīs of charnel grounds. “Now I will teach

source: །།དེ་ནས་ལཱ་མཱའི་མཚན་ཉིད་ནི། །ཡང་དག་རབ་ཏུ་བཤད་པར་བྱ།
en: The telltale signs of the lāmās.

source: །དམར་ཞིང་དཀར་བའི་བུད་མེད་གང་།
en: If a woman has a pink complexion,

source: །པདྨའི་འདབ་མ་ལྟ་བུའི་འོད།
en: And eyes elongated like lotus leaves,

source: །དཀར་པོའི་གོས་ལ་རྟག་དགའ་ཞིང་།
en: “And if she always prefers white clothes,

source: །ཙན་དན་སར་པའི་དྲི་དང་ལྡན།
en: Smells of fresh sandalwood,

source: །བདེ་གཤེགས་འདུས་པ་ཉིད་ལ་དགའ།
en: Delights in the company of bliss-gone ones,

source: །ཆགས་ཤིང་མཐོང་ན་རྗེས་འགྲོ་མ།
en: And responds to affectionate glances,

source: །ཁྱིམ་དུ་པདྨ་འདྲི་བྱེད་པ།
en: “One should draw a lotus in one’s house and worship it,

source: །པདྨ་གར་དབང་རིགས་ལས་བྱུང་།
en: For she belongs to the family of Padmanarteśvara.

source: །སྨིན་མའི་དབུས་སུ་རྩེ་གསུམ་སོན།
en: If a woman has the sign of a trident between her eyebrows,

source: །ལུས་ནི་སྔོ་སངས་སྐྱ་བ་དང་། །ཨུཏྤལ་སྔོན་པོའི་དྲི་དང་མཚུངས།
en: A dark blue face, a white body, {4.3.3} “And the hue and scent of a blue lotus,

source: །ཁྱིམ་དུ་རྡོ་རྗེ་བྲིས་ནས་ནི། །རྟག་ཏུ་མཆོད་པ་བྱེད་པ་ནི།
en: One should draw a vajra scepter in one’s house and always worship it,

source: །ཧེ་རུ་ཀ་དཔལ་རིགས་བྱུང་བ།
en: For she arises from the family of the glorious Heruka

source: །དེ་ནི་མཁའ་འགྲོ་མར་ཤེས་བྱ།
en: And is known as the ‘tranquil ḍākinī.’

source: །མིག་དམར་དཀར་དང་དམར་བ་དང་། །དེ་བཞིན་རྐང་པ་ལག་པ་དམར། །ར་སྐྱེས་ཁྱིམ་བྱ་དག་གིས་ཀྱང་།
en: “If a woman has red eyes, a pink complexion, Red feet and hands,

source: །རྟག་ཏུ་དགའ་བར་གྱུར་པ་དང་། །དེ་ཡི་ཁྱིམ་དུ་རྡོ་རྗེ་ནི།
en: And is always delighted In the company of goats and chickens, “One should draw a vajra scepter in one’s house

source: །བྲིས་ནས་རྟག་ཏུ་མཆོད་བྱེད་པ། །ཧེ་རུ་ཀ་དཔལ་རིགས་བྱུང་བ།
en: And always worship it,

source: །མཁའ་འགྲོར་འདི་ལ་ཐེ་ཚོམ་མེད།
en: For there is no doubt that such ḍākinīs Arise from the family of glorious Heruka.

source: །འཁོར་ལོ་གང་གི་དཔྲལ་བའམ།
en: “If a circle is visible

source: །ལག་པར་ཡང་ནི་མཐོང་གྱུར་པའི།
en: On a woman’s forehead or hand;

source: །སེར་ཞིང་སྔོ་སངས་བུད་མེད་གང་།
en: If she has a yellow and dark blue complexion,

source: །རྟག་ཏུ་གོས་སེར་དགའ་བ་ཉིད།
en: And always prefers yellow clothes;

source: །མེ་ཏོག་དཀར་པོའི་དྲི་ཆེན་དང་། །སྐལ་བཟང་ཕུན་སུམ་ཚོགས་མ་དེ།
en: “And if she is possessed of great beauty and grace, And her head smells of flowers,

source: །ཁྱིམ་དུ་འཁོར་ལོ་འདྲི་བར་བྱེད།
en: One should, accordingly, draw a circle in one’s house,

source: །དེ་བཞིན་གཤེགས་པའི་རིགས་རྗེས་འགྲོ།
en: For she belongs to the Tathāgata family.

source: །གནག་ཅིང་སྔོ་སངས་བུད་མེད་གང་།
en: “If a woman is black and dark blue,

source: །སོ་ནི་དཀར་ཞིང་མཐོ་བ་དང་། །རྟག་ཏུ་གདུག་པའི་གཡོན་པ་ནི།
en: And has prominent, white fangs; If she is beautiful and unremittingly cruel

source: །སྐྲ་ནི་རྟག་ཏུ་གྲོལ་བ་ཡིན།
en: And always wears her hair loose;

source: །རྟག་ཏུ་ཁྲུས་ལ་དགའ་བ་དང་། །སྤྱོད་ཅིང་མང་དུ་སྨྲ་བ་དང་། །རྡོ་རྗེ་ཁྱིམ་དུ་བྲིས་ནས་ནི། །རྟག་ཏུ་མཆོད་པ་བྱེད་པ་ནི།
en: “And if she enjoys bathing constantly And always talks a lot, One should draw a vajra scepter in one’s house,

source: །རྡོ་རྗེ་ཕག་མོའི་རིགས་ལས་བྱུང་།
en: For such a woman arises from the family of Vajravārāhī. “If a woman is white with a golden hue,

source: །དཀར་ཞིང་གསེར་དང་མཚུངས་པ་དང་། །འབར་བའི་མིག་དང་བ་སྤུ་གང་།
en: Has bright eyes, and is hairy;

source: །རྡོ་རྗེ་གང་གི་དཔྲལ་བའམ།
en: If a vajra scepter is visible

source: །ལག་པར་ཡང་ནི་མཐོང་གྱུར་པ།
en: On her forehead or hand; “And if she is of royal stature,

source: །རྟག་ཏུ་རྒྱལ་སྲིད་དགའ་བ་དང་། །སྙེམས་ཤིང་བདེན་པར་སྨྲ་བ་དང་། །མ་ལི་ཀ་ཡི་དྲི་དང་ལྡན།
en: Proud, always speaks the truth, And exudes the scent of jasmine,

source: །ཁྱིམ་དུ་རྡོ་རྗེ་བྲིས་ནས་ནི།
en: One should draw a vajra scepter in one’s house

source: །རྟག་ཏུ་མཆོད་པ་བྱེད་པ་ནི།
en: And worship it continually, “For she is the great queen of yogins, the exalted one,

source: །དུམ་སྐྱེས་མ་ཡི་རིགས་ལས་བྱུང་།
en: Arisen from the family of Khaṇḍarohā.

source: །རྣལ་འབྱོར་དབང་ཕྱུག་ཆེན་མོ་མཆོག །ཤ་ལ་དགའ་བའི་བུད་མེད་གང་།
en: Again, if a woman is fond of eating meat

source: །མིག་སྨན་ནག་པོ་ལྟ་བུའི་འོད།
en: And her eyes are the color of collyrium;

source: །དཔྲལ་བར་མདུང་རྩེའི་རྣམ་པ་ཉིད།
en: “If she has the sign of a spear on her forehead

source: །དྲག་ཤུལ་ལས་ལ་དགའ་བ་གང་།
en: And takes pleasure in cruel acts;

source: །རྟག་ཏུ་དུར་ཁྲོད་འགྲོ་གང་དང་། །འཇིགས་མེད་སྐྱུགས་བྲོ་མེད་པ་དང་། །གང་གི་དཔྲལ་བར་བསྡུས་ནས་ནི།
en: If she continually frequents charnel grounds And is neither frightened nor squeamish; “And if she has a convergence of wrinkles on her forehead,
